In [1]:
!pip install sqlalchemy
!pip install psycopg2

Requirement already satisfied: sqlalchemy in c:\users\16789\.conda\envs\pythondata\lib\site-packages (1.3.17)
Requirement already satisfied: psycopg2 in c:\users\16789\.conda\envs\pythondata\lib\site-packages (2.9.3)

In [2]:
#Import Dependencies
import pandas as pd
import sqlalchemy
from sqlalchemy import create_engine

def add(x, y):
    s = x + y
    return s

num1=1
num2=2
result = add(num1, num2)
print(result)

In [34]:
#Creation of a Python Function to generate the SQL database connection engine

def build_engine(user, pwd, host, port, db):
    engine = create_engine(f'postgresql://{user}:{pwd}@{host}:{port}/{db}')
    return engine

In [35]:
#Variable values used to be passsed into the Python custom engine build function for SQL database connections
user = 'postgres'
pwd = 'postgres'
host = 'localhost'
port = '5432'
db = 'EmployeeSQL'

engine = build_engine(user=user, pwd=pwd, host=host, port=port, db=db)

#After the engine is built, a data frame was created to read the SQL query and the subsequent line displays the data from the data frame

In [36]:
df = pd.read_sql_query('select * from employees', con=engine)

In [37]:
display(df)

,emp_no,birth_date,first_name,last_name,sex,hire_date,emp_title_id
0,473302,1953-07-25,Hideyuki,Zallocco,M,1990-04-28,s0001
1,475053,1954-11-18,Byong,Delgrande,F,1991-09-07,e0002
2,57444,1958-01-30,Berry,Babb,F,1992-03-21,e0002
3,421786,1957-09-28,Xiong,Verhoeff,M,1987-11-26,s0001
4,282238,1952-10-28,Abdelkader,Baumann,F,1991-01-18,e0003
...,...,...,...,...,...,...,...
300019,464231,1958-08-14,Constantino,Eastman,M,1988-10-28,s0001
300020,255832,1955-05-08,Yuping,Dayang,F,1995-02-26,e0002
300021,76671,1959-06-09,Ortrud,Plessier,M,1988-02-24,s0001
300022,264920,1959-09-22,Percy,Samarati,F,1994-09-08,s0001
300023,464503,1964-05-31,Arvind,Slobodova,M,1987-11-23,s0002